#ifndef _CA51M151_CONFIG_H_
#define _CA51M151_CONFIG_H_
/**************************************************************************************************************/
#define IRCH				0
#define IRCL				1

/**************************************************************************************************************/
#define SYSCLK_SRC			IRCH			//芯片系统时钟选择
/**************************************************************************************************************/

/**************************************************************************************************************
	系统时钟有两个时钟可选：IRCH和IRCL，上电后，默认的系统时钟是IRCH，并且CKDIV值为1，即系统时钟上电默认为
	IRCH的二分频(4MHz)，如CPU需运行于更高频率(8MHz)，软件可设置CKDIV为0。

	工作电压范围：2.7V-5.5V@Fosc=8MHz
                 2.2V-5.5V@Fosc=4MHz
***************************************************************************************************************/
#if (SYSCLK_SRC == IRCH)
#define SYSCLK_8MHZ			//系统时钟跑8MHz
	
#ifdef SYSCLK_8MHZ
	#define FOSC				(8000000)
#else 
	#define FOSC				(4000000)
#endif

#elif (SYSCLK_SRC == IRCL)
	#define FOSC				(128000)
#endif
/***************************************************************************************************************/

/*************************UART功能开关宏定义*********************************************************************/
//#define UART1_EN				//如果使用UART1，打开此宏定义
#define UART2_EN				//如果使用UART2，打开此宏定义

#if (defined UART1_EN | defined UART2_EN)
	#define PRINT_EN			//使用uart_printf函数打印使能
#endif

#ifdef UART1_EN
	#define UART1_BAUTRATE		115200
#endif
#ifdef UART2_EN
	#define UART2_BAUTRATE		115200
#endif
/***************************************************************************************************************/

#endif										
